onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ЗначенияНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ЗначенияНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Константа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Настройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_ОбщегоНазначенияПолныеПрава/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение константы по указанному идентификатору.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//  Разрез  - РегистрыСведений.бит_омни_ЗначенияНастроек.Разрез.Тип - Разрез значения константы (необязательный).
//
// Возвращаемое значение:
//   Произвольный - Значение константы.
//
Функция ЗначениеКонстанты(Идентификатор, Разрез = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ЗначениеКонстанты(Идентификатор, Разрез);
КонецФункции

// Возвращает значения констант по указанным идентификаторам.
//
// Параметры:
//  ИдентификаторыСтрокой  - Строка - Идентификаторы констант строкой, разделенные ", ".
//
// Возвращаемое значение:
//   Структура:
//     * Ключ - Идентификатор константы.
//     * Значение - Произвольный - Значение константы.
//
Функция ЗначенияКонстант(ИдентификаторыСтрокой) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ЗначенияКонстант(ИдентификаторыСтрокой);
КонецФункции

// Возвращает признак - используется ли функциональная опция.
//  Под функциональной опцией здесь понимаем дополнительные константы с типом значения "Булево".
//  Считается, что Функциональная опция используется, в случае, если найдено 
//  хотя бы одно значение константы, установленное в ИСТИНА.
//  Например, если константу задаем в разрезе организаций, то считаем, что
//  ФО используется, если установлено ИСТИНА хотябы по одной организации.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   Булево - Признак использования ФО.
//
Функция ФункциональнаяОпцияИспользуется(Идентификатор) Экспорт	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ФункциональнаяОпцияИспользуется(Идентификатор);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание константы.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - Строка таблицы описания констант, в которой содержится полная информация о константе.
//   	Описание колонок строки таблицы см. в НовыйТаблицаОписанияКонстант().
//
Функция ОписаниеКонстанты(Идентификатор) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.бит_омни_Настройки.ОписаниеКонстанты(Идентификатор);
КонецФункции

// Возвращает таблицу полного описания констант.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица описания констант, в которой содержится полная информация о всех актуальных константах.
//   	Описание колонок таблицы см. в Справочники.бит_омни_Настройки.НовыйТаблицаОписанияКонстант().
Функция ТаблицаОписанияКонстант() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.бит_омни_Настройки.ТаблицаОписанияКонстант();
КонецФункции


// Функция - Получить настройку пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, настройку которого нужно получить, 
//		если не указан - используется ПараметрыСеанса.ТекущийПользователь
//  Настройка	 - ПланВидовХарактеристикСсылка.НастройкиПользователей - Настройка, которую нужно получить
// 
// Возвращаемое значение:
//   Произвольный - Данные из регистра сведений НастройкиПользователей с отбором по пользователю и настройке
//
Функция ПолучитьНастройкуПользователя(Пользователь = Неопределено, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	НЗНастройки = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НЗНастройки.Отбор.Пользователь.Установить(Пользователь);
	НЗНастройки.Отбор.Настройка.Установить(Настройка);
	НЗНастройки.Прочитать();
	
	Если НЗНастройки.Количество() Тогда
		
		Возврат НЗНастройки.Получить(0).Значение;
		
	КонецЕсли;
		
	Возврат Настройка.ТипЗначения.ПривестиЗначение(Неопределено);
		
КонецФункции

#КонецОбласти
